In [2]:
# Un dataFrame es un conjunto definido de datos, se pueden ordenar, agrupra, combinarlos, fucionarlos
import pandas as pd

In [4]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [6]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [8]:
# Agregar una nueva columna
df['Salario'] = [30000, 45000, 38000, 32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [10]:
# Modificar el contenido de una columna ya existente
df['Salario'] = df['Salario'] + 2000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    47000
2  Carlos    22   Valencia    40000
3    Sara    27     Bilbao    34000

In [12]:
# Modificar el contenido de una columna en particular y almacenarla en una variable
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [14]:
mayores_25 = df[df['Edad'] > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [24]:
# Otra forma
edades = df['Edad']
edades

0    25
1    30
2    22
3    27
Name: Edad, dtype: int64

In [26]:
mayores_25 = df[edades > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [18]:
type(df)

pandas.core.frame.DataFrame

In [20]:
type(edades)

pandas.core.series.Series

In [22]:
type(mayores_25)

pandas.core.frame.DataFrame

In [44]:
# Agregar la columna Edad_en_10_años
df['Edad_en_10_años'] = df['Edad'] + 10
df

   Nombre  Edad     Ciudad  Salario  Es_Mayor_de_25  Edad_en_10_años
0     Ana    25     MADRID    32000            True               35
1    Luis    30  BARCELONA    47000            True               40
2  Carlos    22   VALENCIA    40000           False               32
3    Sara    27     BILBAO    34000            True               37

In [38]:
# Convertir la columna Ciudad a mayúsculas
df['Ciudad'] = df['Ciudad'].str.upper()
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     MADRID    32000
1    Luis    30  BARCELONA    47000
2  Carlos    22   VALENCIA    40000
3    Sara    27     BILBAO    34000

In [40]:
# Crea una nueva columna Es_Mayor_de_25 que contenga valores booleanos: True si la persona tiene 25 años o más, y False en caso contrario.
# Crear la columna Es_Mayor_de_25
df['Es_Mayor_de_25'] = df['Edad'] >= 25
df

   Nombre  Edad     Ciudad  Salario  Es_Mayor_de_25
0     Ana    25     MADRID    32000            True
1    Luis    30  BARCELONA    47000            True
2  Carlos    22   VALENCIA    40000           False
3    Sara    27     BILBAO    34000            True